#+title: Bowmacs Config

**** Org notes
#+begin_src elisp
(setq bowmacs-org-notes-path "~/dev/notes.org")
(setq bowmacs-org-todo-path "~/dev/todo.org")

(after! org-capture
  (setq org-capture-templates
        '(("t" "todo" entry (file bowmacs-org-notes-path) "* TODO %?")
          ("n" "note" entry (file bowmacs-org-notes-path) "* %?"))))

(map! :leader
      :desc "Open notes.org"
      "n f" (lambda () (interactive) (find-file bowmacs-org-notes-path)))

(map! :leader
      :desc "Open todo.org"
      "n t" (lambda () (interactive) (find-file bowmacs-org-todo-path)))
#+end_src

#+RESULTS:
: #[nil ((find-file bowmacs-org-notes-path)) nil nil nil nil]

